Revit 2027 API
RebarUpdateCurvesData.IsBendingRadiusChanged Property
 Indicates if the bending radius has changed since the last regeneration.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsBendingRadiusChanged { get; }
Public ReadOnly Property IsBendingRadiusChanged As Boolean
	Get
public:
property bool IsBendingRadiusChanged {
	bool get ();
}
member IsBendingRadiusChanged : bool with get
Property Value
Boolean
See Also
Reference
RebarUpdateCurvesData Class
Autodesk.Revit.DB.Structure Namespace